In [1]:
import pandas as pd
import numpy as np

In [4]:
my_data = np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,20]])

In [5]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [6]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [7]:
my_names = ["James", "Lars", "Kirk", "Rob"]

In [14]:
my_columns = ["jan","feb","mar"]

In [15]:
my_data_frame = pd.DataFrame(my_data)

In [16]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [17]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [18]:
my_data_frame[1]

0    20
1    30
2    50
3    15
Name: 1, dtype: int32

In [21]:
new_data_frame = pd.DataFrame(my_data, index=my_names, columns=my_columns)

In [23]:
new_data_frame

       jan  feb  mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [24]:
new_data_frame.iloc[3]

jan    10
feb    15
mar    20
Name: Rob, dtype: int32

In [25]:
 new_data_frame["Apr"] = new_data_frame["mar"] * 2

In [26]:
new_data_frame

       jan  feb  mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [27]:
new_data_frame.drop("Rob",axis=0)

       jan  feb  mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20

In [28]:
new_data_frame

       jan  feb  mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [29]:
new_data_frame.drop("Apr",axis=1,inplace=True)

In [30]:
new_data_frame

       jan  feb  mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [32]:
new_data_frame["jan"]["Lars"]

20

In [33]:
boolean_frame = new_data_frame > 25

In [34]:
boolean_frame

         jan    feb    mar
James  False  False   True
Lars   False   True   True
Kirk   False   True  False
Rob    False  False  False

In [35]:
new_data_frame[boolean_frame]

       jan   feb   mar
James  NaN   NaN  30.0
Lars   NaN  30.0  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [36]:
new_data_frame[new_data_frame["mar"] > 25]

       jan  feb  mar
James   10   20   30
Lars    20   30   40

In [37]:
new_data_frame.reset_index()

   index  jan  feb  mar
0  James   10   20   30
1   Lars   20   30   40
2   Kirk   20   50   10
3    Rob   10   15   20

In [38]:
new_data_frame["NewIndex"] = ["jam","lar", "kir", "robert"]

In [39]:
new_data_frame

       jan  feb  mar NewIndex
James   10   20   30      jam
Lars    20   30   40      lar
Kirk    20   50   10      kir
Rob     10   15   20   robert

In [40]:
new_data_frame.set_index("NewIndex")

          jan  feb  mar
NewIndex
jam        10   20   30
lar        20   30   40
kir        20   50   10
robert     10   15   20

In [41]:
new_data_frame.drop("NewIndex",axis=1, inplace=True)

In [42]:
new_data_frame

       jan  feb  mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20